<template>
  <v-app>
    <div id="app">

      <v-toolbar dense dark class="indigo lighten-1 white--text text-center" outlined elevation="0">
        <v-toolbar-title>ТЕОРИКО-ИГРОВЫЕ МОДЕЛИ В ИНФОРМАЦИОННЫХ СИСТЕМАХ</v-toolbar-title>
        <v-spacer></v-spacer>
        Филиппова В.В.
        <div class="text-center">
          <v-dialog v-model="dialog" width="500">
            <template v-slot:activator="{ on, attrs }">
              <v-btn icon v-bind="attrs" v-on="on">
                <v-icon>mdi-heart</v-icon>
              </v-btn>
            </template>
            <v-card>
              <v-card-title class="text-h5 grey lighten-2">
                Вы нажали на сердечко
              </v-card-title>
              <v-card-text>
                А это значит, что вы хороший человек. Спасибо!
              </v-card-text>

              <v-divider></v-divider>

              <v-card-actions>
                <v-spacer></v-spacer>
                <v-btn color="primary" text @click="dialog = false">
                  Оки :)
                </v-btn>
              </v-card-actions>
            </v-card>
          </v-dialog>
        </div>



      </v-toolbar>

      <v-main class="content">
        <div style="margin:10px">
          <h2>ЧТО ТАКОЕ ТЕОРИЯ ИГР?</h2>
          <p>
            <b> Теория игр</b> — математический метод изучения оптимальных стратегий в играх. Под игрой понимается
            процесс, в котором участвуют две и более стороны, ведущие борьбу за реализацию своих интересов. Каждая из
            сторон имеет
            свою цель и использует некоторую стратегию, которая может вести к выигрышу или проигрышу — в зависимости от
            поведения других игроков (шахматы, шашки, футбол, покер).<br>
            <b>КЛАССИЧЕСКАЯ ЗАДАЧА</b><br>
            <b>«Дилемма заключенного»</b><br>
            Двое преступников, А и Б, попались примерно в одно и то же время на преступлении. Есть основания полагать,
            что
            они действовали по сговору, и полиция, изолировав их друг от друга, предлагает им одну и ту же сделку:
            Если один свидетельствует против другого, а тот хранит молчание, то первый освобождается за помощь
            следствию,
            а второй получает максимальный срок лишения свободы (10 лет).
            Если оба молчат, их деяние проходит по более лёгкой статье, и они приговариваются к 6 месяцам.
            Если оба свидетельствуют против друг друга, они получают минимальный срок (по 2 года).
            Каждый заключённый выбирает, молчать или свидетельствовать против другого. Однако ни один из них не знает
            точно, что сделает другой. Что произойдёт?
          </p>
        </div>

        <div class="table">
          <v-simple-table>
            <template v-slot:default>
              <tbody>
                <tr>
                  <td></td>
                  <td><b>Преступник Б Стратегия «молчать»</b></td>
                  <td><b>Преступник Б Стратегия «предать»</b></td>
                </tr>
                <tr>
                  <td><b>Преступник А Стратегия «молчать» </b></td>
                  <td>Пол года каждому
                  </td>
                  <td>10 Лет преступнику А Отпустить преступника Б </td>
                </tr>
                <tr>
                  <td><b>Преступник А Стратегия «предать»</b></td>
                  <td>10 Лет преступнику Б Отпустить преступника А</td>
                  <td>2 года каждому</td>
                </tr>
              </tbody>
            </template>
          </v-simple-table>
        </div>
        <div style="margin:10px">
          <h2>ТИПЫ ИГР</h2><br>
          <div class="wrapper">
            <div class="text">
              <p>
                Кооперативная\некооперативная игра <br>
                Кооперативной игрой является конфликт, в котором игроки могут общаться между собой и объединяться в
                группы
                для достижения наилучшего результата. Из двух типов игр, некооперативные описывают ситуации в мельчайших
                деталях и выдают более точные результаты. Кооперативные рассматривают процесс игры в целом.
              </p>
            </div>
            <div class="image">
              <v-img width="600" src="./assets/1_tip.png"></v-img>
            </div>
          </div>
          <div class="wrapper">
            <div class="image">
              <v-img width="600" src="./assets/2_tip.png"></v-img>
            </div>
            <div class="text">
              <p>
                С нулевой суммой и с ненулевой суммой <br>
                Игрой с нулевой суммой называют игру, в которой выигрыш одного игрока равняется проигрышу другого. В
                игре
                же с ненулевой суммой может изменяться общая цена игры, таким образом принося выгоду одному игроку, не
                отнимаю ее цену у другого.
              </p>
            </div>
          </div>
          <div class="wrapper">
            <div class="text">
              <p>
                Параллельные и последовательные <br>
                Параллельной является игра, в которой игроки делают ходы одновременно, либо ход одного игрока неизвестен
                другому, пока не завершится общий цикл. В последовательной игре каждый игрок владеет информацией о
                предыдущем ходе своего оппонента до того, как сделать свой выбор.
              </p>
            </div>
            <div class="image">
              <v-img width="600" src="./assets/3_tip.png"></v-img>
            </div>
            <div class="wrapper">
              <div class="image">
                <v-img width="600" src="./assets/4_tip.png"></v-img>
              </div>
              <div class="text">
                <p>
                  С полной или неполной информацией <br>
                  Эти типы являются подвидом последовательных игр, и названия их говорят сами за себя.
                </p>
              </div>
            </div>
          </div>
        </div>
        <div class="wrapper" style="margin:10px">
          <h2>ПРИМЕНЕНИЕ ТЕОРИКО-ИГРОВЫХ МОДЕЛЕЙ</h2> <br>
          <p>
            Теория игр находит свое применение во всех областях социальных наук, а также в логике, экономике, системной
            науке и информатике. Например:
            СПИСОК
            (социология) теория игр рассматривает человеческое взаимодействие именно как игру;
            (логика) та самая дилемма заключенного, рассмотренная ранее, и много ей подобных логических игр;
            (экономика) рыночная конкуренция;
            (экология) загрязнение окружающей среды;
            (информатика) разработка компьютерных приложений (в том числе и игр), оптимизация программы, обучение
            нейронных сетей.
            Последний вариант нас интересует больше, вот и рассмотрим его подробнее.
          </p>
          <div class="image">
            <v-img width="600" src="./assets/5_tip.png"></v-img>
          </div>
          <div class="image">
            <v-img width="600" src="./assets/6_tip.png"></v-img>
          </div>
        </div>
        <div style="margin:10px">
          <br>
          <h2>ИГРА В ИНФОРМАЦИОННЫХ СИСТЕМАХ</h2><br>
          <p>
            Сильно востребованы исследования в сфере компьютерных технологий, например анализ аукционов, которые
            проводятся компьютерами в автоматическом режиме. Кроме того, теория игр сегодня позволяет еще раз задуматься
            над тем, как работают компьютеры, каким образом строится кооперация между ними. Скажем, серверы в сети можно
            рассматривать как игроков, которые пытаются скоординировать свои действия/
          </p>
        </div>
        <div class="wrapper" style="margin:10px">
          <h2>КОМПЬЮТЕРНЫЕ ИГРЫ</h2><br>
          <div class="text">
            <p>
              Первое что приходит на ум при упоминании теории игр в информационных технологиях – это компьютерные игры
              или
              иначе «видеоигры». Но тут не все так просто. <br>
              Данный раздел науки был создан, когда компьютерные игры пребывали в зачаточном состоянии, и поэтому имеет
              отношение к ним очень слабое. В классической теории игр рассматриваются лишь математические модели, и за
              названием раздела скрывается всего лишь раздел теории вероятностей для игровых нужд. Для изучения феномена
              компьютерных игр одной математики явно недостаточно. <br>
              Лишь совсем недавно появилась соответствующая наука, которая занимается всеми вопросами, связанными с
              компьютерными играми. <br>
              Людология – наука, занимающаяся исследованиями игр как современной формы коммуникации и творчества.
            </p>
          </div>
          <div class="image">
            <v-img width="600" src="./assets/7_tip.png"></v-img>
          </div>
        </div>
        <div class="wrapper" style="margin:10px">
          <h2>СЕТЕВАЯ АРХИТЕКТУРА</h2>
          <p>
            Сетевая архитектура - это проектирование компьютерной сети. Это основа для спецификации физических
            компонентов
            сети, их функциональной организации и конфигурации, принципов ее работы и процедур, а также используемых
            протоколов связи.
            Теория игр широко используется в исследованиях беспроводных сетей для понимания точек стабильной работы
            сетей,
            состоящих из автономных/самостоятельных узлов. Узлы рассматриваются как игроки. Служебные функции часто
            выбираются в соответствии с достигнутой скоростью соединения или аналогичными техническими показателями.
            Исследования, проведенные в этом контексте, могут быть сгруппированы следующим образом: <br>

          </p>
          <div class="image">
            <v-img width="600" src="./assets/8_tip.png"></v-img>
          </div>
          <div class="image">
            <v-img width="500" src="./assets/9_tip.png"></v-img>
          </div>
        </div>
        <div style="margin:10px">
          <h2>ТЕОРИЯ ИГР КАК МЕХАНИЗМ ДЛЯ АНАЛИЗА КРУПНОМАСШТАБНЫХ ДАННЫХ</h2>
          <p>
            Метод PCA как равновесие Нэша.
            Анализ главных компонентов (PCA) – популярный метод анализа больших наборов данных, содержащих большое
            количество измерений / признаков на одно наблюдение. <br>
            Равновесие Нэша – концепция решения, одно из ключевых понятий теории игр. Так называется набор стратегий в
            игре для двух и более игроков, в котором ни один участник не может увеличить выигрыш, изменив свою
            стратегию, если другие участники своих стратегий не меняют. <br>
            В настоящее время PCA подход повсеместно используется в качестве средства, обеспечивающего первый этап
            работы конвейера обработки данных и позволяющего с лёгкостью визуализировать данные. Со времени изобретения
            метода
            PCA прошло уже более века, но до сей поры он не утратил своей актуальности. <br>
            1. Раньше данные заносились вручную в бумажные блокноты, их было не так много, и их обработка не
            представляла сложности, а сейчас они хранятся в центрах обработки данных огромных размеров, и применение
            метода требует
            колоссальных вычислительных ресурсов. Исследователи пытались применять рандомизированные алгоритмы и другие
            методы, повышающие качество масштабирования метода PCA, однако, как удалось выяснить, такие подходы
            практически неприменимы к массивным наборам данных. <br>
            2. Метод PCA имеет много общего с множеством важных инженерных методов и алгоритмов машинного обучения, в
            частности с методом разложения по сингулярным значениям (SVD). Благодаря правильно выбранному подходу к
            применению метода PCA данные алгоритмы стали широко применяться во всех областях машинного обучения.
          </p>
        </div>
        <div style="margin:10px">
          <h2>ИСКУССТВЕННЫЕ НЕЙРОННЫЕ СЕТИ</h2>
          <div>
            <p>
              Искусственная нейронная сеть — математическая модель, а также ее программное или аппаратное воплощение,
              построенная по принципу организации и функционирования биологических нейронных сетей — сетей нервных
              клеток живого организма. <br>
              Нейронные сети не программируются в привычном смысле этого слова, они обучаются. Возможность обучения —
              одно из главных преимуществ нейронных сетей перед традиционными алгоритмами. Технически обучение
              заключается в
              нахождении коэффициентов связей между нейронами. В процессе обучения нейронная сеть способна выявлять
              сложные
              зависимости между входными данными и выходными, а также выполнять обобщение. Это значит, что в случае
              успешного обучения сеть сможет вернуть верный результат на основании данных, которые отсутствовали в
              обучающей
              выборке, а также неполных и/или «зашумленных», частично искажённых данных.
            </p>
          </div>
          <div>
            <v-img style=" margin: auto;" width="600" src="./assets/10_tip.png"></v-img>
          </div>
        </div>
        <div style="margin:10px">
          <h2>НЕЙРОННЫЕ СЕТИ И ТЕОРИЯ ИГР</h2>
          <div>
            <p>
              Генетический алгоритм обучения
              По своему принципу он схож с эволюционными процессами природы, которые основываются на комбинировании
              (скрещивании) результатов. <br>
              Другими словами, происходит естественный отбор, где новое поколение является продуктом комбинации
              результатов
              с самыми лучшими свойствами. Если итог такого скрещивания не подходит по каким-то критериям, то отбор
              совершается вновь, пока продукт не станет совершенным. <br>

              Приведем аналогию на примере обучения Яндекс-роботов:
              Изначально конструируется много роботов для исследования работы нейронной сети. Стоит заметить, что в этот
              момент они обучаются независимо друг от друга.
              Далее создается выборка по нескольким критериям (координация в пространстве, минимум дтп и так далее), и
              «мозги» этих роботов (обычно 5-10 штук) усредняются и клонируются в новое поколение роботов. И так доводя
              до
              идеала.
            </p>
          </div>
        </div>
        <div>
          <v-img style=" margin: auto;" width="600" src="./assets/11_tip.png"></v-img>
        </div>
        <div>
          <p>
            Причем же здесь теория игр?
            Можно отследить ее признаки:
            Больше одного игрока (выборка из 1000 роботов);
            Имеется цель и стратегия(доставить заказ по определенному маршруту без столкновений)
            Есть победители и проигравшие (доставили – не доставили).
          </p>
        </div>
        <div style="margin:10px">
          <h2> ВЫВОД</h2>
          <p>
            Таким образом в ходе выполнения данной работы мне удалось достигнуть поставленной цели и выполнить все
            необходимые для этого задачи, а то есть:
            изучить концепцию теорико-игровых моделей в информационных системах, а конкретно:
            дала определения основным понятиям темы;
            обозначила сферы применения теории игр;
            проанализировала влияние теорико-игровых моделей на информационную систему.
          </p>
        </div>
        <div style="margin:10px">
          <h2>ЛИТЕРАТУРА</h2>
          <p>
            Нейман Дж. фон, Моргенштерн О. Теория игр и экономическое поведение. — М.: Наука, 1970. — 983 с. <br>
            Васин А. А., Морозов В. В. Теория игр и модели математической экономики. — М.: МГУ, 2005. — 272 с. <br>
            Позиционные игры / ред. Воробьёв Н. Н., Врублевская И. Н.. — Москва: Наука, 1967. — 522 с. <br>
            Язов Ю.К. Сердечный A.Л., Шаров И.A. Методический подходов к оцениванию эффективности ложных информационных
            систем. 2014. с. 55-60. <br>
            Горбань А.Н. Обучение нейронных сетей. — М.: СССР-США СП «Параграф», 1990. — 160 с. <br>
            Ерёмин Д. М., Гарцеев И. Б. Искусственные нейронные сети в интеллектуальных системах управления. — М.:
            МИРЭА,
            2004. — 75 с. <br>
            Теория игр [Электронный ресурс]. – URL: https://habr.com/ru/post/163681/ (дата обращения: 29.11.2022) <br>
            Теория игр как механизм для анализа крупномасштабных данных [Электронный ресурс]. – URL:
            https://habr.com/ru/company/skillfactory/blog/560138/ (дата обращения: 29.11.2022) <br>
            Генетический алгоритм [Электронный ресурс]. – URL: https://www.youtube.com/watch?v=SfEZSyvbj2w (дата
            обращения: 29.11.2022) <br>
          </p>
        </div>
      </v-main>
      <v-footer dark padless>
        <v-card flat tile class="indigo lighten-1 white--text text-center">
          <v-card-text>
            <v-btn icon @click="vk()">VK</v-btn>
          </v-card-text>
          <v-card-text class="white--text pt-0">
            Данный веб-сайт создан в учебных целях студенткой СПБГУТ, 1 курс, факультет ИСИТ. Информация,
            представленная на странице является сборником из всего того, что мне удалось найти в Интернете по
            теме "Теорико-Игровые модели в Информационных системах". Эти данные не являются истиной
            в последней инстанции. По всем вопросам можно обращаться в литературу, указанную ниже,
            либо ко мне на почту vvveronika2019@mail.ru.
          </v-card-text>

          <v-divider></v-divider>

          <v-card-text class="white--text">
            {{ new Date().getFullYear() }}
          </v-card-text>
        </v-card>
      </v-footer>
    </div>
  </v-app>
</template>

<script>

export default {

  name: 'App',
  data: () => ({
    dialog: false,
    icons: [
      'mdi-facebook',
      'mdi-twitter',
      'mdi-linkedin',
      'mdi-instagram',
    ],
  }),
  methods:{
    vk() {
      window.location.href = "https://vk.com/veronika_gut"
    },
  }
};
</script>
<style>
* {
  margin: 0;
  padding: 0;
}

.content {
  min-height: calc(100vh - 80px);
  background-color: rgb(255, 250, 244);
}

.table {
  width: 700px;
  margin: auto;
}

H2 {
  text-align: center
}

p {
  font-size: 20px;
}

.wrapper {
  width: 100%;
  display: inline-block;
}

.text {
  width: 50%;
  float: left;
}

.image {
  width: 50%;
  float: left;
}
</style>